In [7]:
import pandas as pd

titanic = pd.read_csv("titanic_data.csv")

In [8]:
titanic.head()

,PassengerId,Name,PClass,Age,Sex,Survived
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [9]:
titanic.describe()

       PassengerId         Age     Survived
count  1313.000000  756.000000  1313.000000
mean    657.000000   30.397989     0.342727
std     379.174762   14.259049     0.474802
min       1.000000    0.170000     0.000000
25%     329.000000   21.000000     0.000000
50%     657.000000   28.000000     0.000000
75%     985.000000   39.000000     1.000000
max    1313.000000   71.000000     1.000000

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1313 non-null   int64
 1   Name         1313 non-null   object
 2   PClass       1313 non-null   object
 3   Age          756 non-null    float64
 4   Sex          1313 non-null   object
 5   Survived     1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB